truncate Клиенты, Модели_корма, Продукт, Заказы, Время_заказа restart identity cascade;

insert into Клиенты (фамилия, имя, отчество, телефон, Емаил) values
('Орлов', 'С.', 'Н.', '+79000000001', 'orlov@mail.ru'),
('Белова', 'М.', 'А.', '+79000000002', 'belova@mail.ru');

insert into Модели_корма (Название, Вид_животного, Класс_Корма) values
('Royal Canin Kitten', 'Кошки', 'Премиум'),
('Purina Dog Chow', 'Собаки', 'Эконом');

insert into Продукт (ID_модели, вес_КГ, вкус, цена, изображение, количество_в_заказе) values
(1, 2, 'Курица', 2500, 'img/rc_k_ch.jpg', 15),
(1, 10, 'Курица', 9500, 'img/rc_k_ch.jpg', 4),
(2, 5, 'Говядина', 1800, 'img/pd_c_gv.jpg', 20),
(1, 2, 'Индейка', 2700, 'img/rc_k_in.jpg', 10),
(2, 15, 'Говядина', 4200, 'img/pd_c_gv.jpg', 8);

insert into Заказы (ID_клиент, дата_заказа) values
(1, '2026-11-05'),
(2, '2026-11-12'),
(1, '2026-11-20'),
(2, '2026-11-20');

insert into Время_заказа (ID_заказа, ID_продукт, количество) values
(1, 1, 2),
(1, 2, 1),
(2, 3, 1),
(3, 4, 1),
(4, 5, 1);